Revit 2026 API

# ExporterIFCRegisterFaceWithElementHandle Method

---

Register face with element handle to make sure the openings created are related to the right element.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RegisterFaceWithElementHandle(
	Face face,
	IFCAnyHandle elemHandle
)
```
```vb
Public Sub RegisterFaceWithElementHandle (
	face As Face,
	elemHandle As IFCAnyHandle
)
```
```cpp
public:
void RegisterFaceWithElementHandle(
	Face^ face,
	IFCAnyHandle^ elemHandle
)
```
```fsharp
member RegisterFaceWithElementHandle :
        face : Face *
        elemHandle : IFCAnyHandle -> unit
```

#### Parameters

face Face
     The face.
elemHandle IFCAnyHandle
     The element handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace